using System;
namespace Asawer
{
    public struct Constants
    {
        public struct Database
        {
            public const string LocalDatabaseName = "Asawer.db3";

            public struct Tables
            {
                public const string Countries = "countries";
                public const string Status = "marital_status";
                public const string Age = "ages";
                public const string ContactTime = "available_time";
                public const string Education = "educ_levels";
                public const string EyesColor = "eye_colors";
                public const string GoalFromSite = "usage_purpose";
                public const string HairColor = "hair_color";
                public const string Height = "heights";
                public const string Job = "jobs";
                public const string Time = "timezones";
                public const string Weight = "weights";
                public const string About = "about";
                public const string Accounts = "accounts";
                public const string Blocks = "blocks";
                public const string BulkMessages = "bulkmessages";
                public const string CardCompanies = "card_companies";
                public const string Categories = "categories";
                public const string ContactPreferneces = "contact_preferences";
                public const string ContactWays = "contact_ways";
                public const string Emails = "emails";
                public const string Images = "images";
                public const string Interests = "interests";
                public const string LastActivity = "lastactivity";
                public const string MassMessage = "mass_message";
                public const string Messages = "messages";
                public const string PendingEmails = "pendingmail";
                public const string Privacy = "privacy";
                public const string Scrolling = "scrolling";
                public const string SecurityWarnings = "securitywarnings";
                public const string TempMass = "tempmass";
                public const string Transactions = "transactions";
                public const string UserColors = "user_colors";
                public const string Users = "users";
                public const string Visits = "visits";
            }
        }        

        public struct FunctionsUri
        {
            public const string GetSpinnerItemsUri = "GetsAllItemsFromTable.php";
            public const string GetTwoColumnsSpinnersItemUri = "GetItemsFromTableWithTwoColumns.php";
            public const string LoginUri = "Login.php";
            public const string RegisterUri = "AppRegister.php";
            public const string SearchUri = "AppSearch.php";
            public const string InboxUri = "inbox.php";
            public const string OutboxUri = "outbox.php";
            public const string UpdateUri = "Update.php";
            public const string SendMessageUri = "SendMessage.php";
            public const string BlockUri = "block.php";
            public const string InterestUri = "interest.php";
            public const string DeleteMessageUri = "DeleteMessage.php";
            public const string LogMessage = "AppLogging.php";
            public const string VisitsUri = "visit.php";
            public const string GetActions = "GetActions.php";
            public const string Subscribe = "Subscribe.php";

            //private const string HostIP = "http://www.asawer.net/api";
            //public const string GetSpinnerItemsUri = "http://www.asawer.net/api/GetsAllItemsFromTable.php";
            //public const string GetTwoColumnsSpinnersItemUri = "http://www.asawer.net/api/GetItemsFromTableWithTwoColumns.php";
            //public const string LoginUri = "http://www.asawer.net/api/Login.php";
            //public const string RegisterUri = "http://www.asawer.net/api/AppRegister.php";
            //public const string SearchUri = "http://www.asawer.net/api/AppSearch.php";
            //public const string InboxUri = "http://www.asawer.net/api/inbox.php";
            //public const string OutboxUri = "http://www.asawer.net/api/outbox.php";
            //public const string UpdateUri = "http://www.asawer.net/api/update.php";
            //public const string SendMessageUri = "http://www.asawer.net/api/SendMessage.php";
            //public const string BlockUri = "http://www.asawer.net/api/block.php";
            //public const string InterestUri = "http://www.asawer.net/api/interest.php";
            //public const string DeleteMessageUri = "http://www.asawer.net/api/DeleteMessage.php";
            //public const string LogMessage = "http://www.asawer.net/api/AppLogging.php";
            //public const string VisitsUri = "http://www.asawer.net/api/visit.php";
            //public const string GetActions = "http://www.asawer.net/api/GetActions.php";
            //public const string Subscribe = "http://www.asawer.net/api/Subscribe.php";
        }

        public struct TabsNames
        {
            public const string Search = "البحث";
            public const string Inbox = "الوارد";
            public const string Outbox = "الصادر";
            public const string FromCamera = "من الكاميرا";
            public const string FromGallery = "من الغاليري";
            public const string Cancel = "إلغاء";
            public const string AddPhoto = "أضف صورة";

        }

        public struct DefaultValues
        {
            public const string NA = "غير متاح";
            public const string FamilyStatus = "الوضع العائلي";
            public const string EyesColor = "لون العين";
            public const string HairColor = "لون الشعر";
            public const string Height = "الطول";
            public const string Weight = "الوزن";
            public const string GoalFromSite = "الهدف من الموقع";
            public const string Age = "العمر";
            public const string EducationLevel = "المستوى العلمي";
            public const string OriginCountry = "بلد الأصل";
            public const string ResidenceCountry = "بلد السكن";
            public const string Job = "الوظيفة";
            public const string TimeZone = "توقيت";
            public const string ContactTime = "الوقت للإتصال";
        }

        public struct UI
        {
            public const string Sex = "الجنس";
            public const string Male = "ذكر";
            public const string Female = "أنثى";
            public const string RegistrationLoader = "الرجاء الانتظار، يتم التسجيل";
            public const string LoginLoader = "الرجاء الانتظار، يتم تسجيل الدخول";
            public const string SearchLoader = "الرجاء الانتظار، جاري البحث";
            public const string SuccessfullRegistration = "تم التسجيل بنجاح";
            public const string FetchDataLoader = "الرجاء الانتظار، يتم تنزيل المعلومات";
            public const string UpdateLoader = "الرجاء الانتظار، يتم تحديث المعلومات";
            public const string SuccessfullUpdate = "تم التحديث بنجاح";
            public const string ErrorOccured = "حصل خطأ";
            public const string Upgrade = "عليك أن تكون مشتركاً لتكمل";
            public const string Cancel = "إلغاء";
            public const string Subscribe = "إشترك";
            public const string Subscription = "إشتراك";
            public const string MessageDeleted = "تم حذف الرسالة";
            public const string LogoutMessage = "هل أنت متأكد من الخروج";
            public const string LogoutHeader = "تسجيل الخروج";
            public const string Logout = "خروج";
            public const string Login = "تسجيل الدخول";
            public const string UserName = "إسم المستخدم";
            public const string Password = "كلمة السر";
            public const string Email = " البريد";
            public const string FullName = "الإسم الكامل";
            public const string WhoAreWeTitle = "من نحن";
            public const string ContactUs = "اتصل بنا";
            public const string TermsAndConditionTitle = "شروط الإستخدام";
            public const string SecurityPolicyTitle = "تحذيرات الأمان";
            public const string PrivacyPolicyTitle = "سياسة الخصوصية";
            public const string WhoAreWeBody = "موقع أحباب هو موقع متخصص للتعارف والتواصل والزواج كما هو متخصص أيضا في زواج المسيار والتعارف على أصدقاء جدد وثقافات جديدة. يمكنك التعارف على اصدقاء من بلدك كما في بلدان اخرى عبر العالم";
            public const string TermsAndConditionsBody = "موقع احباب للتعارف والزواج يرغب بكم ادارة موقغ احباب يرحب بكم ويتمنى لكم كل التوفيق في الموقع ولذلك الرجاء قراءة شروط الاستخدام وتحذيرات الامان قبل التسجيل والرجا العمل بها بكل دقة يجب أن لا يكون عمر المشترك أقل من 18 سنة. للأعضاء الحق فى انهاء عضويتهم فى اى وقت كما يحق لموقع احباب أن تقوم بالغاء عضوية أى عضو دون الرجوع اليه,كما أنه اذا بدر من العضو أى مخالفة لشروط العضوية يتم انهاء عضويته يحق لموقع احباب ايقاف اى عضو يتعدى على الموقع باى شكل من الاشكال سواء كتابيا او لفظيا يحق لموقع احباب ايقاف اى عضو يتعدى على اى مشترك داخل موقع احباب بالفاظ خارجه عن العرف ادارة الموقع لا تقوم باعطاء اية معلومات عن اي مشترك لاي شخص كان او لاي جهة كانت مهما كانت الاسباب والظروف الموقع لا يقوم بالتاكد من المشاركين او المشاركات في الموقع ولا من عنواينهم ولا ارقامهم لذلك ننصحكم بالتاكد مع الشخص اللذي تتحدثون معه بانفسكم ادارة الموقع لا تقوم اطلاقا بمراقبة الرسائل المتبادله بين المشاركين لاننا نعتبر انها امور خاصة لا نسمح لاي من مشرفينا او موظفينا بالاطلاع عليها ولكن فقط في حال وجود اي شكوى من الرسايل بانها تخالف شروط الموقع يقوم فريق الموقع بالدخول الى الرسائل ومراقبتهاالموقع للاستخدام الشخصى فقط وغير مسموح باستخدام الموقع تجارياً من قبل الأعضاء بأى صورة كانت ومن يفعل ذلك يعرض نفسه للمساءلة القانونية مع انهاء عضويته للموقع الحق فى تعديل أو الغاء اى معلومات موجودة فى الموقع بما فى ذلك البيانات التى يقوم الاعضاء بادخالها والتى قد لاتتناسب مع لوائح العمل فى الموقع او غير متفقة مع القيم والتقاليد أو تدعوا الى الكراهية أو اتجاهات فكرية أو سياسية أو تحتوى على معلومات دعائية أو تجارية او عناوين مواقع او بريد اليكترونى لن تتم الموافقة على اى طلب للتواصل فى حالة ان ملف البيانات للعضو غير مكتمل عدم ارسال اي مبلغ مادي الى اي مشارك مهما كانت الاسباب والظروف عدم اعطاء اي مشارك اخر عنوان سكنكم الاصلي وذلك قبل التاكد من الشخص المقابل قبل التاكد من نواياه وهدفه عدم اعطاء ايه تفاصيل عن حساباتكم المصرفية من حسابات عادية او بطاقات ائتمانية وعدم اعطاء ايه ارقام سرية او ارقام دخول الى اي احد في الموقع يمنع تماما  رفع اى صوره غير الصور الشخصية للاعضاء الذكور كما يمنع رفع صور المشاهير يمنع استخدام الاسماء والعبارات المخلة بالاداب.مثل(مثير - حار جدا - اعشق النساء ) يمنع رفع الصوره الفاضحه، سواء صور شخصية او صور من الانترنت.الصور فقط عباره عن صور عادية متحشمة الموقع غير مسؤول عن أي نتائج سلبيه لاى تعارف خارج الموقع من خلال البريد او التليفون الموقع غير مسؤل عن اى نتائج تترب على افصاحك عن بياناتك الخاصه لاى مشترك فى الموقع الموقع غير مسؤل عن اى نتائج سلبيه لوضع صور البنات الراغبات فى الزواج من خلال الموقع يمكن لاى مشترك التقدم ببلاغ عن اى شخص مخالف داخل الموقع او شخص هدفه التسلية";
            public const string SecurityPolicyBody = "ان ادارة موقع احباب هي ادارة مستقلة ولا يتبع لنا اي موقع اخر لا من قريب ولا من بعيد كما وانه لدبنا فريق عمل يعمل بشكل متواصل لمدة 24 ساعة يوميا لذلك تتوجه ادارة موقع احباب الى مشاركينا بتحذيرات الامان ونامل منكم التقيد بها عدم ارسال اي مبلغ مالي لاي مشترك تتعرفون عليه في الموقع مهما كانت الاسباب والظروف عدم اعطاء اي شخص تتعرفون عليه في الموقع اي معلومات عن حساباتكم المالية او ارقام حسابات او اي معلومات عن بطاقات الائتمان عدم اعطاء اي معلومات خاصة لاي مشترك تتعرفون عليه في الموقع معلومات عن حياتكم الخاصة او عملكم او حساباتكم عدم اعطاء اي مشترك تتعرفون عليه في الموقع اي معلومات عن حساباتكم في الموقع او اي موقع اخر او اعطاء اي اسم مستخدم اوكلمة السر لاي كان بتم ايقاف المشترك بدون سابق انذار فى حالة كتابة الاسم الظاهر على الموقع بشكل غير لائق او يحتوى على وسيلة اتصال او كلمة خارجة او معنى غير الاسماء المتعارف عليها الموقع غير مسؤل عن اى نتائج سلبيه لوضع صور البنات الراغبات فى الزواج من خلال الموقع الموقع غير مسؤل عن اى نتائج سلبيه لاى تعارف خارج الموقع من خلال البريد او التليفون يحق لموقع احباب ايقاف اى عضو يتعدى على الموقع باى شكل من الاشكال سواء كتابيا او لفظيا يحق لادارة موقع احباب تغيير او تبديل شروط الاستخدام او تحذيرات الامان في اي وقت تراه الادارة مناسب يمكنكم دائما مراسلة ادارة الموقع وعلى مدار الساعة عبر info @ahbaab.com";
            public const string PrivacyPolicyBody = " خلق أصحاب هذه الخدمة بيان الخصوصية هذا(السياسة) من أجل إظهار التزامهم الثابت لمساعدة المستخدمين على التفهم بشكل أفضل أي معلومات نجمع عنهم ، وماذا يمكن أن يحدث لتلك المعلوماتahbaab.com يكشف لنا التالي جمع المعلومات وممارسات النشر نظرة عامة كجزء من عملية عادية من خدماتنا نجمع المعلومات ، وفي بعض الحالات ، قد نكشف المعلومات عنك . سياسة الخصوصية هذه تصف المعلومات التي نجمعها حولك وحول ما قد يحدث لتلك المعلومات. بقبولك هذه الخصوصية والاحكام والشروط،فإنك توافق على استخدامنا والكشف عن المعلومات الشخصية الخاصة بك على الوجه المبين في هذه الخصوصية.يتم تضمين هذه المعلومات في سياسة الخصوصية وتخضع لشروط بنود وشروط.بيان الخصوصية هذا ينطبق على جميع المواقع ذات الصلة. جميع المواقع الأخرى في جميع أنحاء العالم تعمل في ظل ممارسات الخصوصية مماثلة كما هو موضح في سياسة الخصوصية هذه ، وتخضع لمتطلبات القانون المحلي المعمول به ، ونحن نسعى جاهدين لتوفير مجموعة متناسقة من ممارسات الخصوصية في جميع أنحاء مواقع شخصية على الانترنت.\n\n 1.مذكرة خاصة حول الأطفال\n\n الأطفال ليسوا مؤهلين للاستفادة من الخدمات التي نقدمها ، ونحن نطلب أن القصر (تحت سن 18) لا يقدم أية معلومات شخصية لنا.إذا كنت قاصرا ، يمكنك استخدام هذه الخدمة فقط بالاشتراك مع والديك أو أولياء أمورهم.\n\n 2.المعلومات التي نجمعها\n\n هدفنا الرئيسي في جمع المعلومات الشخصية هو أن نقدم لك تجربة سلسة و فعالة ، وهذا يسمح لنا لتقديم الخدمات والميزات التي على الأرجح تلبي احتياجاتكم وتخصيص خدمتنا لجعل تجربتكم أسهل.هل توافق على أن من أجل مساعدة أعضائنا للقاء بعضهم البعض أننا قد نضم تشكيلات الأعضاء في النشرات الإخبارية التي نرسل بها من وقت لآخر لأعضائنا. اسمك وعنوانك ورقم الهاتف هي سرية ولن يتم نشرها في التعريف الخاص بك.التعريف الخاص بك هو متاح للأعضاء الآخرين في عرضها.ملامح الأعضاء تتضمن وصفا والصور ، وماذا يحب وماذا يكره ، والمقالات الفردية وغيرها من المعلومات المفيدة في تحديد التطابق.ملف التعريف الخاص بك للعرض لا يتضمن أي معلومات تحديد عنك ، ما عدا اسم المستخدم الذي اخترته عند التسجيل. نحن تلقائيا تعقب بعض المعلومات على أساس سلوكك على مواقعنا على الإنترنت باستخدام الكوكيز وغيرها من الأجهزة.نحن نستخدم هذه المعلومات لأغراض البحوث الداخلية على التركيبة السكانية و أعضائنا ، والمصالح ، والسلوك من أجل فهم أفضل وخدمتكم وخدمة مجتمعنا.وقد تشمل هذه المعلومات URL الذي خرجت للتو من (ما إذا كان هذا العنوان هو على موقعنا أو لا). URL التي تذهب بجانب(ما إذا كان هذا العنوان هو على موقعنا أو لا) ، ما المتصفح الذي تستخدمه ، وعنوان IP الخاص بك. نحن نستخدم أجهزة جمع البيانات مثل \"الكوكيز\" على صفحات معينة من مواقع الويب لدينا. \"الكوكيز\" هي ملفات صغيرة توضع على القرص الصلب يمكن أن تساعدنا في تقديم خدمات مخصصة. كما نقدم بعض الميزات التي لا تتوفر إلا من خلال استخدام \"كوكي\". الكوكيز يمكن أن تساعدنا أيضا تقديم المعلومات التي تستهدف مصالحكم. معظم ملفات تعريف الارتباط \"كوكيز\" ، بمعنى ان يتم حذف تلقائيا من القرص الصلب في نهاية الدورة.أنت دائما حرا في رفض الكوكيز لدينا إذا كان المتصفح الخاص بك يسمح نستخدم طرف ثالث شركة الاعلانات ، لخدمة الإعلانات نيابة عنا عبر الإنترنت. يجوز للطرف ثالث أيضا جمع معلومات مجهولة المصدر عن زياراتك لموقعنا.\n\n 3. استخدام المعلومات الخاصة بك\n\n نستخدم المعلومات في الملفات التي نحفظها لكم ، وغيرها من المعلومات التي نحصل عليها من نشاطاتك الحالية والسابقة على المواقع الإلكترونية لتسوية المنازعات ، واستكشاف المشاكل وفرض الشروط .في بعض الأحيان ، قد ننظر عبر أعضاء متعددة لتحديد المشاكل أو حل النزاعات ، وبخاصة أننا قد نفحص المعلومات الخاصة بك لتحديد أعضاء متعددة عضو رقم التعريف أو الأسماء المستعارة. أنت توافق على أننا قد تستخدم معلومات شخصية عنك لتحسين جهودنا التسويقية والترويجية ، لتحليل استخدام الموقع ، وتحسين محتوى ومنتجات تقنية المعلومات ، وتخصيص محتوى الموقع ، والتخطيط ، والخدمات.هذه الاستخدامات تحسن موقعنا وزيادة تكييفها لتلبية احتياجاتكم. أنت توافق على أننا قد نستخدم معلوماتك للاتصال بك وتقديم المعلومات لك أنه في بعض الحالات ، تستهدف مصالحكم ، مثل شعار الاعلانات المستهدفة ، والإشعارات الإدارية ، ومنتجات تقنية المعلومات والاتصالات ذات الصلة على استخدامك على المواقع. من خلال قبول سياسة الخصوصية هذه ، فإنك توافق صراحة على تلقي هذه المعلومات.\n\n 4.كشف معلوماتك\n\n بسبب البيئة التنظيمية القائمة ، لا يمكننا أبدا ضمان جميع البلاغات الخاصة وغيرها من المعلومات الشخصية أن يتم الكشف عنها بطرق غير الوارد وصفها إلا في هذه الخصوصية.على سبيل المثال (ودون تقييد ما سبق) ، قد نكون مضطرين الى الكشف عن المعلومات إلى الحكومة ووكالات تطبيق القانون أو أطراف ثالثة.في ظل ظروف معينة ، أطراف ثالثة بصورة غير قانونية قد تعترض وصول الإرسال أو اتصالات خاصة أو أفراد قد ترتكب التعسف أو إساءة استخدام المعلومات الخاصة بك التي يجمعونها من مواقعنا على الإنترنت.لذا ، على الرغم من أننا نستخدم الممارسات الصناعية القياسية لحماية خصوصيتك ، ونحن لا نعد ، ويجب أن لا نتوقع أن معلوماتك الشخصية أو الاتصالات الخاصة ستبقى دائما خاصة. كمسألة سياسة ، ونحن لا نقوم ببيع أو تأجير أي معلومات شخصية عنك إلى أي طرف ثالث.ومع ذلك ، التالي يصف بعض الطرق التي قد يتم الكشف عن معلوماتك الشخصية.\n\nالمعلنين.نحن نجمع (جمع البيانات احتياطيا عبر حسابات أعضائنا جميع) المعلومات الشخصية والكشف عن هذه المعلومات بطريقة غير شخصية إلى المعلنين وأطراف ثالثة أخرى للتسويق وغيرها من الأغراض الترويجية.ومع ذلك ، في هذه الحالات ، نحن لا نكشف لهذه الكيانات المعلومات التي يمكن استخدامها في التعرف عليك شخصيا.بعض المعلومات ، مثل اسمك وعنوان البريد الالكتروني ، كلمة السر ، رقم بطاقة الائتمان ورقم الحساب المصرفي ،ليست متاحة لمعلنين التسويق.قد نستخدم شركات الاعلان من طرف ثالث لخدمة الإعلانات نيابة عنا.قد تكون هذه الشركات توظف الكوكيز والعمل به (والتي تعرف أيضا باسم غيفس بكسل جفتس أو منارات الويب) لقياس فعالية الإعلان.أي معلومات تفيد بأن هذه الأطراف الثالثة عن طريق جمع الكوكيز والعمل به هو مجهول تماما.\n\nمقدمي الخدمة الخارجية.\n\nقد يكون هناك عدد من الخدمات المقدمة من قبل مقدمي الخدمة الخارجية التي تساعدك على استخدام المواقع لدينا.إذا اخترت استخدام هذه الخدمات الاختيارية ، وخلال قيامك بذلك ،يمكنك عدم الكشف عن معلومات لمقدمي الخدمات الخارجية و / أو منحهم إذن لجمع معلومات عنك ، عندها ، استخدامهم لمعلوماتك يخضع لسياستها الخاصة.\n\nشركة كيانات أخرى.\n\nنتشاطر الكثير من البيانات المتوفرة لدينا ، بما في ذلك معلومات شخصية عنك ، مع شركتنا الأم و / أو الشركات التابعة التي تلتزم خدمة احتياجاتك الخاصة على الانترنت والخدمات المرتبطة بها ، في جميع أنحاء العالم.إلى حد أن هذه الكيانات يمكنها الحصول على المعلومات الخاصة بك ، سوف يعاملون بقدر من الحماية حيث يتعاملون مع المعلومات التي يحصلون عليها من أعضائها الخاصة.الشركة الأم و / أو شركاتها سوف يتبعون ممارسات الخصوصية ليست أقل واقية من جميع الأعضاء في ممارساتنا الموصوفة في هذه الوثيقة ، بالقدر الذي يسمح به القانون المعمول به.فمن الممكن أن نحن و / أو شركاتها التابعة ، أو أي تركيبة من هذا القبيل ، يمكن أن تندمج مع أو في حال الحصول لأحد علينا ككيان عمل آخر ، في حال حصول هكذا جمع ، يجب أن تتوقع اننا سوف نشاطر بعض أو كامل معلوماتك من أجل الاستمرار في تقديم الخدمة. وسوف تتلقى إشعارا بهكذا حدث (بالقدر الذي يحدث) ونحن سوف تتطلب من الكيان المجموع الجديد متابعة الممارسات التي أفصح عنها في سياسة الخصوصية هذه.\n\nمتطلبات القانونية.نحن تتعاون مع ما يطلبه تطبيق القانون من تحقيقات ، فضلا عن أطراف أخرى لتطبيق القوانين ، مثل : حقوق الملكية الفكرية ، والاحتيال وغيرها من الحقوق. يمكننا (وتخولونا) الكشف عن أية معلومات عنك لتطبيق القانون وغيرهم من المسؤولين الحكوميين ونحن ، في تقديرنا ، رأينا من الضروري أو المناسب ، في إطار تحقيق في الاحتيال ، وانتهاكات حقوق الملكية الفكرية ، أو أي نشاط آخر غير شرعي أو قد يعرض لنا أو لكم للمسؤولية القانونية.\n\n5.استخدام المعلومات الخاصة بالأعضاء الآخرين\n\nخدماتنا تشمل أيضا الحصول على الرسائل الفورية وغرف الدردشة. كعضو لديك حق الوصول إلى رقم هوية العضو، وربما يمكنك الوصول إلى معلومات الاتصال الأخرى من الأعضاء (ق) من خلال الاستخدام المنتظم لمراسلة الفورية وغرف الدردشة.من خلال قبول سياسة الخصوصية هذه ، فإنك توافق على أنه ، فيما يتعلق بالمعلومات الأعضاء الآخرين الشخصية التي تحصل عليها من خلال الاتصالات والرسائل الفورية ، وغرف الدردشة والبريد الإلكتروني ، نحن هنا نمنحك ترخيص لاستخدام مثل هذه المعلومات فقط من أجل : (أ) شركة الاتصالات ذات الصلة التي هي ليست رسائل تجارية غير مرغوب فيها ، و (ب) لأي غرض من الأغراض الأخرى التي يوافق هؤلاء الأعضاء عليها بعد الكشف الكافي لهذا الغرض . في جميع الحالات ، يجب عليك إعطاء الأعضاء فرصة لإزالة أنفسهم من قاعدة البيانات الخاصة بك وفرصة لاستعراض ما هي المعلومات التي تم جمعها عنهم.بالإضافة إلى ذلك ، تحت أي ظرف من الظروف ، إلا كما هو محدد في هذا القسم ، يمكنك الكشف عن معلومات شخصية عن عضو آخر إلى أي طرف ثالث من دون موافقتنا وموافقة أعضاء أخرى من هذا القبيل بعد الكشف الكافي. ahbaab.com وأعضائنا لا نقبل السبام.ولذلك ، من دون تحديد ما سب غير مرخص لك بإضافة عضوا من ب تو إلى قائمة البريد الخاصة بك (البريد الإلكتروني أو المادي) دون موافقة صريحة منها مكتوبة بعد الكشف الكافي.للتبليغ عن سبام من مشترك آخر من ahbaab.com ، ، يرجى الاتصال بنا باستخدام صفحة اتصل بنا\n\n 6. استعراض وتغيير الملف الشخصي الخاص بك\n\nبعد التسجيل ، يمكنك مراجعة وتغيير المعلومات التي قدمت أثناء التسجيل عن طريق خدمة الأعضاء القائمة بما في ذلك : كلمة السر وعنوان البريد الإلكتروني.إذا قمت بتغيير كلمة السر والبريد الإلكتروني ونحن تتبع كلمة المرور القديمة والبريد الإلكتروني. يمكنك أيضا تغيير معلومات التسجيل الخاصة بك مثل : الاسم والعنوان والمدينة والولاية ، والرمز البريدي ، البلد ، رقم الهاتف ، لمحة ، ماذا يحب وماذا يكره ، والمطلوب ملف تاريخ والمقالات ويحفظ معايير البحث.\n\nبناء على طلبك المكتوب ، سنقوم بتعليق عضويتكم ، معلومات الاتصال ، والمعلومات المالية من قواعد البيانات النشطة. وسيتم تعليق هذه المعلومات في أقرب وقت ممكن بصورة معقولة وفقا لسياسة تعليق لدينا والقانون الواجب التطبيق.لإزالة التعريف الخاص بك بحيث لا يمكن للآخرين مشاهدته ، يمكنك زيارة صفحة ملف إلغاء تنشيط متوفرة بعد تسجيل الدخول.\n\nسوف نحتفظ في ملفاتنا لك المعلومات التي طلبتها لإزالة لظروف معينة ، مثل حل النزاعات ، استكشاف المشاكل وفرض الشروط والشروط.كذلك ، يتم أبدا مثل هذه المعلومات قبل إزالتها تماما من قواعد بياناتنا بسبب القيود التقنية والقانونية ، بما في ذلك أنظمة تخزين \"احتياطية\".لذا ، يجب أن لا نتوقع أن تكون جميع المعلومات الشخصية الخاصة بك مزالة تماما من قواعد بياناتنا استجابة لطلباتك.\n\n7. السيطرة على كلمة السر\n\nأنت مسؤولا عن جميع الإجراءات التي اتخذت مع معلومات تسجيل الدخول وكلمة المرور ، بما في ذلك الرسوم.لذا فإننا لا ننصح بالكشف عن كلمة مرور ahbaab.com أو معلومات تسجيل الدخول إلى أي طرف ثالث.إذا اخترت لتقاسم هذه المعلومات مع أطراف ثالثة لتوفر لك خدمات إضافية ، فأنت مسؤول عن جميع الإجراءات التي اتخذت مع معلومات تسجيل الدخول وكلمة السر ، وبالتالي يجب مراجعة سياسة كل طرف ثالث الخصوصية. إذا فقدت السيطرة على كلمة السر الخاصة بك ، قد تفقد سيطرة كبيرة على معلوماتك الشخصية ويمكن أن تخضع لإجراءات ملزمة قانونا اتخذت نيابة عنك.لذلك ، إذا تم اختراق كلمة المرور الخاصة بك لأي سبب من الأسباب ، يجب على الفور تغيير باسورد الخاص\n\n8.جامعي معلومات أخرى\n\nباستثناء ما هو خلاف ذلك في سياسة الخصوصية هذه ، فإن هذه الوثيقة لا تتناول سوى استخدام والكشف عن المعلومات التي نجمعها منك.إلى حد أن تقوم بالإفصاح عن معلوماتك لأطراف أخرى ، سواء أكانوا على مواقعنا على الإنترنت أو على مواقع أخرى في جميع أنحاء شبكة الإنترنت ، قد تطبق قواعد مختلفة لاستخدامها أو الكشف عن المعلومات التي تكشف لهم. إلى حد أن نستخدم المعلنين طرف ثالث ، وثباتهم على سياسات الخصوصية الخاصة بهم.بما أن ahbaab.com لا تسيطر على سياسات الخصوصية لأطراف ثالثة ، فإنك تكون خاضعا لطرح الأسئلة قبل الكشف عن المعلومات الشخصية للآخرين\n\n 9.أمن\n\nahbaab.com يستخدم الممارسات الصناعية القياسية للحفاظ على سرية معلوماتك الشخصية ، بما في ذلك \"الجدران النارية\" والمقابس الآمنة الطبقات.ahbaab.com يعامل البيانات كأصل التي يجب حمايتها من الضياع والدخول غير المصرح به.نوظف العديد من التقنيات الأمنية المختلفة لحماية هذه البيانات من الوصول غير المصرح به من قبل أعضاء من داخل وخارج الشركة ومع ذلك أمن تام لا وجود لها على شبكة الإنترنت\n\n10.إشعار\n\nقد نقوم بتغيير سياسة الخصوصية هذه من وقت لآخر بناء على تعليقاتكم وحاجتنا لتعكس بدقة تجميعنا للبيانات وممارسات الإفصاح. كل التغييرات على هذه السياسة فعالة بعد ظهورها على الموقع.\n\n";
            public const string SelfDescription = "أوصف نفسك";
            public const string PartnerDescription = "أوصف الشريك";
            public const string ContactWays = "طرق التواصل";
            public const string Register = "التسجيل";
            public const string VisitCountTo = "عدد زوار البيانات";
            public const string BlocksTo = "لائحة المنع";
            public const string BlocksFrom = "عدد الملفات الممنوعة";
            public const string InterestsTo = "عدد المعجبين";
            public const string InterestsFrom = "عدد الإعجابات";
            public const string SearchResults = "عدد نتائج البحث";
        }

        public struct Settings
        {
            public const string UsernamePreferenceName = "Username";
            public const string PasswordPreferenceName = "Password";
        }
    }
}

